app/views/events/_new.html.erb

INSERT INTO "events" DEFAULT VALUES RETURNING "id"
---
 <div class="control-group">
        <%= form_for Event.create, url: calendars_path, method: :post do |f| %>