calendar-spotify-api/app/controllers/api/v1/events_controller.rb

          def index
          render json: Event.order(:start_date)
---
SELECT "events".* FROM "events" ORDER BY "events"."start_date" ASC