calendar-spotify-api/app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events" ORDER BY "events"."created_at" ASC
---
          def index
          render json: Event.all

INSERT INTO "events" ("title", "created_at", "updated_at", "start_date") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "edited Test event 1"], ["created_at", "2018-06-24 23:10:59.552192"], ["updated_at", "2018-06-24 23:10:59.552192"], ["start_date", "2018-09-02"]]
---
           def create
              @event= Event.create(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
            def show
               render json: @event = Event.find(params[:id])