app/controllers/calendars_controller.rb

SELECT "events".* FROM "events" WHERE (categories in (NULL))
SELECT "events"."start_date" FROM "events"
SELECT  "events".* FROM "events" WHERE "events"."start_date" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def index

        @events = Event.all

        @dates = Event.select('start_date')
        @specificdate = Event.includes(params[:start_date])

INSERT INTO "events" ("description", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["description", "dfdf"], ["start_date", "2018-01-06"], ["end_date", "2018-01-06"]]
---
      def create
      Event.create(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 17]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
      def destroy
        Event.find(params[:id]).destroy