app/controllers/events_controller.rb

    def index

        @events = Event.all
---
SELECT "events".* FROM "events" start_date

      def create
      Event.create(event_params)
---
INSERT INTO "events" ("description", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["description", "dfdf"], ["start_date", "2018-06-18"], ["end_date", "2018-06-18"]]